CFD_results/16.5mm-3out/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
80212
(
(0.0197468950800352 0.0166569026107497 0.672887832788933)
(-0.00671494858999419 -0.00251750788052355 0.64952863888591)
(0.00392847243132088 0.0215645898346538 0.682891500124971)
(-0.00686307151448205 -0.00673740552251447 0.703654191530917)
(-0.00314562429420893 -0.00425132721373073 0.688629674627291)
(-0.002804627308555 -0.00383369686486055 0.688627443229257)
(0.000318040965541642 -0.00497152132729536 0.681887389954496)
(0.00381674035533738 -0.00691841479857472 0.685631990483602)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           uniform (-0 -0 0.68221749474325);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
398
(
(-0.25445030812452 -0.123820679983171 -0.464490537810553)
(-0.227988343604605 -0.11693464904051 -0.451950553891784)
(-0.199511582430255 -0.0722879511061906 -0.434586917789142)
(-0.207791601607896 -0.0774058649842068 -0.409537474924308)
(-0.161760119018772 -0.145900545562049 -0.386896866672172)
(-0.161054448727179 -0.124841651885051 -0.392224312104329)
(-0.176476371329143 -0.112119979554772 -0.428214849616326)
(-0.176596865051207 -0.112099730508516 -0.417683619360495)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
