CFD_results/16.5mm-3out/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
228458
(
1.33642329454732e-07
-5.46608185061048e-09
-5.44158210109348e-09
-1.2075683431364e-07
-1.71533278712747e-09
-2.62412856013414e-10
-9.69659004869692e-08
-9.89752680278288e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
224
(
-5.63008974796821e-08
-5.68494064025704e-08
-4.55227677867489e-08
-3.71440236115987e-08
-1.16650996864376e-07
-1.35005116640613e-07
-5.49559050278284e-08
-5.38104871312978e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.63673095857427e-08
2.11845132643027e-08
3.09008826172062e-08
3.46459045047693e-08
6.37163157184936e-08
8.6854560674282e-08
3.18196288853168e-08
2.45035637333904e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
